Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: An autocommand is a command that is executed automatically in response to some event, such as a file being read or written or a buffer change. Through the use of autocommands you can train Vim to edit compressed files, for example. That is used in the |gzip| plugin. Autocommands are very powerful. Use them with care and they will help you avoid typing many commands. Use them carelessly and they will cause a lot of trouble.
es_es: Una orden automática (Autocommand) es una orden a ejecutar en respuesta otro evento, un archivo siendo leído y editado o un cambio en un búfer, por ejemplo. Por ejemplo, Vim puede editar archivos comprimidos a través de las órdenes automáticas. La extensión |gzip| hace uso de esto. Las órdenes automáticas son muy potentes. Úselos con cuidado, y le ayudarán a disminuir el número de órdenes que introduce. Úselos sin cuidado, y generarán un gran número de problemas.

source: Suppose you want to replace a datestamp on the end of a file every time it is written. First you define a function: >
es_es: Suponga que desea reemplazar una marca de tiempo al final del archivo cada vez que se escriba. Primero, define una función: >

source: You want this function to be called each time, just before a file is written. This will make that happen: >
es_es: Desea que esta función se invoque justo antes de guardar un archivo. Lo siguiente lo logra este objetivo: >

source: :autocmd [group] {events} {file_pattern} [nested] {command}
es_es: :autocmd [grupo] {eventos} {patrón_archivo} [anidado] {orden}

source: The [group] name is optional. It is used in managing and calling the commands (more on this later). The {events} parameter is a list of events (comma separated) that trigger the command. {file_pattern} is a filename, usually with wildcards. For example, using "*.txt" makes the autocommand be used for all files whose name end in ".txt". The optional [nested] flag allows for nesting of autocommands (see below), and finally, {command} is the command to be executed.
es_es: El elemento [grupo] es opcional. Se usa al gestionar e invocar las órdenes (más información más adelante). El parámetro {eventos} es una lista separada por comas de eventos que inician la orden. {patrón_archivo} es un nombre de archivo, a menudo con comodines. Por ejemplo, usar «*.txt» provoca que la orden automática afecte a todos los archivos cuyo nombre termina en «.txt». La elemento opcional [anidado] permite anidar órdenes automáticas (a continuación), y, por último, {orden} es la orden a ejecutar.

source: One of the most useful events is BufReadPost. It is triggered after a new file is being edited. It is commonly used to set option values. For example, you know that "*.gsm" files are GNU assembly language. To get the syntax file right, define this autocommand: >
es_es: Uno de los eventos más útiles es «BufReadPost». Se inicia después de editar un nuevo archivo. Se usa habitualmente para definir valores para opciones. Por ejemplo, sabe que los archivos «.gsm» están escritos en lenguaje ensamblador de GNU. Especifique esta orden para obtener la adecuada sintaxis de archivo: >

source: If Vim is able to detect the type of file, it will set the 'filetype' option for you. This triggers the Filetype event. Use this to do something when a certain type of file is edited. For example, to load a list of abbreviations for text files: >
es_es: Si Vim es capaz de detectar el tipo de archivo, definirá la opción 'filetype' automáticamente. Los siguiente incia el evento «Filetype». Puede usarlo para iniciar una acción al editar un tipo de archivo en particular. Por ejemplo, para cargar una lista de abreviaturas de archivos de texto: >

source: The {file_pattern} argument can actually be a comma-separated list of file patterns. For example: "*.c,*.h" matches files ending in ".c" and ".h". The usual file wildcards can be used. Here is a summary of the most often used ones:
es_es: El argumento {patrón_archivo] puede ser una lista separada por comas de patrones de archivo. Por ejemplo, "*.c,*.h" coincide con los archivos terminados en «.c» y «.h». Puede usar los comodines de archivo habituales. Aquí tiene un resumen de los más usados:

source: * Match any character any number of times ? Match any character once [abc] Match the character a, b or c . Matches a dot a{b,c} Matches "ab" and "ac"
es_es: * Busca cualquier caracteres cualquier número de veces ? Busca cualquier carácter una vez [abc] Busca el carácter a, b o c . Busca un punto a{b,c} Busca «ab» y «ac»

source: Note: When working on a system that uses a backslash as file separator, such as MS-Windows, you still use forward slashes in autocommands. This makes it easier to write the pattern, since a backslash has a special meaning. It also makes the autocommands portable.
es_es: Nota: Al trabajar con un sistema que usa la barra inversa como separador de archivos, como MS-Windows, necesita una barra inclinada en las órdenes automáticas. Esto facilita escribir un patrón, ya que la barra inversa tiene un significado especial. También hace portables las órdenes automáticas.

source: To delete an autocommand, use the same command as what it was defined with, but leave out the {command} at the end and use a !. Example: >
es_es: Para eliminar una orden automática, use la misma orden con la que se definió, pero omitiendo la {orden} al final y usando «!». Ejemplo: >

source: The list can be very long, especially when filetype detection is used. To list only part of the commands, specify the group, event and/or pattern. For example, to list all BufNewFile autocommands: >
es_es: Esta lista puede ser muy largo, en particular si se utiliza la detección de tipo de archivo. Para listar sólo parte de las órdenes, especifique el grupo, evento y/o patrón. Por ejemplo, para listar todas las órdenes automáticas para «BufNewFile»: >

source: Using "*" for the event will list all the events. To list all autocommands for the cprograms group: >
es_es: Usar «*» como el evento lista todos los eventos. Para listar todas las órdenes automáticas del grupo cprograms: >

source: The {group} item, used when defining an autocommand, groups related autocommands together. This can be used to delete all the autocommands in a certain group, for example. When defining several autocommands for a certain group, use the ":augroup" command. For example, let's define autocommands for C programs: >
es_es: El elemento {grupo}, usado al definir una orden automática, agrupa órdenes automáticas relacionadas. Se puede usar para eliminar todas las órdenes automáticas en un grupo particular, por ejemplo. Al definir varias órdenes automáticas para un grupo particular, use la orden «:augroup». Por ejemplo, vamos a definir unas órdenes automáticas para programas C: >

source: Generally, commands executed as the result of an autocommand event will not trigger any new events. If you read a file in response to a FileChangedShell event, it will not trigger the autocommands that would set the syntax, for example. To make the events triggered, add the "nested" argument: >
es_es: Habitualmente, las órdenes ejecutadas como resultado de un evento de orden automática no iniciarán ningún evento nuevo. Si lee un archivo como respuesta a un evento «FileChangedShell», no iniciará las órdenes automáticas que definirían la sintaxis, por ejemplo. Para que se los eventos se inicien, añada el argumento «nested»: >

source: It is possible to trigger an autocommand by pretending an event has occurred. This is useful to have one autocommand trigger another one. Example: >
es_es: Es posible iniciar una orden automática simulando un evento. Es útil para que una orden automática inicie otra. Ejemplo: >

source: This defines an autocommand that is triggered when a new file has been edited. The file name must end in ".new". The ":execute" command uses expression evaluation to form a new command and execute it. When editing the file "tryout.c.new" the executed command will be: >
es_es: Esto define una orden automática que se inicia al editar un nuevo archivo. El nombre de archivo debe terminar con «.new». La orden «:execute» usa expresiones de evaluación para formar una nueva orden y ejecutarla. La orden ejecutada al editar el archivo «prueba.c.new» sería: >

source: ":doautocmd" executes on the current buffer. The ":doautoall" command works like "doautocmd" except it executes on all the buffers.
es_es: «:doautocmd» se ejecuta en el búfer actual. La orden «:doautoall» funciona como «doautocmd», con la diferencia de que afecta a todos los búfers.

source: The commands executed by an autocommand are Command-line commands. If you want to use a Normal mode command, the ":normal" command can be used. Example: >
es_es: Las órdenes ejecutadas por una orden automática son órdenes del modo Línea de órdenes. Si desea usar una orden del modo normal, puede usar la orden «:normal». Ejemplo: >

source: This will make the cursor jump to the last line of *.log files when you start to edit it. Using the ":normal" command is a bit tricky. First of all, make sure its argument is a complete command, including all the arguments. When you use "i" to go to Insert mode, there must also be a <Esc> to leave Insert mode again. If you use a "/" to start a search pattern, there must be a <CR> to execute it. The ":normal" command uses all the text after it as commands. Thus there can be no | and another command following. To work around this, put the ":normal" command inside an ":execute" command. This also makes it possible to pass unprintable characters in a convenient way. Example: >
es_es: Esto hará que el cursor salte a la última línea de archivos «*.log» cuando empieza a editarlo. Usar la orden «:normal» es un poco difícil. Primero, compruebe que su argumento es una orden completa, incluyendo todos los argumentos. Cuando usa una «i» para entrar el modo Insertar, también debe tener un <Esc> para abandonar el modo Insertar. Si usa «/» para iniciar una búsqueda de un patrón, debe usar <CR> para ejecutarlo. La orden «:normal» usa todo el texto a continuación como órdenes. Por ello, no debe estar presente «|» y una orden a continuación. Para solucionar este problema, ubique la orden «:normal» dentro de una orden «:execute». También posibilita pasar caracteres no imprimibles de una forma cómoda. Ejemplo: >

source: This also shows the use of a backslash to break a long command into more lines. This can be used in Vim scripts (not at the command line).
es_es: Esto también muestra el usa de la barra inversa para dividir una orden en varias líneas. Se puede usar en scripts de Vim (no en la línea de órdenes).

source: When you want the autocommand do something complicated, which involves jumping around in the file and then returning to the original position, you may want to restore the view on the file. See |restore-position| for an example.
es_es: Si desea que la orden automática haga algo más complicado, que incluya saltar de un punto a otro en el archivo para volver finalmente a la posición inicial, puede que desee restaurar la vista del archivo. Para un ejemplo, consulte |restore-position|.

source: At times, you will not want to trigger an autocommand. The 'eventignore' option contains a list of events that will be totally ignored. For example, the following causes events for entering and leaving a window to be ignored: >
es_es: A veces, no querrá iniciar una orden automática. La opción 'eventignore' contiene una lista de eventos a ignorar. Por ejemplo, lo siguiente provoca que se ignoren los siguientes eventos iniciados al entrar y salir de un programa: >

source: *usr_11.txt* For Vim version 7.3. Last change: 2010 Jul 20
es_es: *usr_11.esx* Para Vim versión 7.3. Último cambio: 20/6/2010

source: Recovering from a crash
es_es: Recuperarse de un fallo

source: |11.1| Basic recovery |11.2| Where is the swap file? |11.3| Crashed or not? |11.4| Further reading
es_es: |11.1| Recuperación básica |11.2| ¿Dónde está el archivo de intercambio? |11.3| ¿Se ha colgado o no? |11.4| Más información

source: Next chapter: |usr_12.txt| Clever tricks Previous chapter: |usr_10.txt| Making big changes Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_12.esx| Trucos Capítulo anterior: |usr_10.esx| Realizar grandes cambios Tabla de contenidos: |usr_toc.esx|

source: *11.1* Basic recovery
es_es: *11.1* Recuperación básica

source: In most cases recovering a file is quite simple, assuming you know which file you were editing (and the harddisk is still working). Start Vim on the file, with the "-r" argument added: >
es_es: En la mayoría de los casos, recuperar un archivo es bastante sencillo, si suponemos que sabe qué archivo estaba editando (y el disco duro aún funciona). Inicie Vim con el archivo y el argumento «-r»: >

source: vim -r help.txt
es_es: vim -r ayuda.txt

source: Vim will read the swap file (used to store text you were editing) and may read bits and pieces of the original file. If Vim recovered your changes you will see these messages (with different file names, of course):
es_es: Vim leerá el archivo de intercambio (empleado para almacenar el texto editado) y puede que lea bits y porciones del texto original. Verá los siguientes mensajes si todo ha ido bien (con nombres de fichero diferentes, por supuesto).

source: :write help.txt.recovered
es_es: :write ayuda.txt.recuperado

source: Compare the file with the original file to check if you ended up with what you expected. Vimdiff is very useful for this |08.7|. For example: >
es_es: Compare el archivo con el original para ver si obtuvo lo que esperaba. Vimdiff es muy útil para esta tarea |08.7|. Por ejemplo: >

source: Watch out for the original file to contain a more recent version (you saved the file just before the computer crashed). And check that no lines are missing (something went wrong that Vim could not recover). If Vim produces warning messages when recovering, read them carefully. This is rare though.
es_es: Compruebe que el archivo original no contenga una versión más reciente (guardó el archivo justo antes de que el sistema diese un fallo). Compruebe también que no se ha omitido ninguna línea (algo ha ido mal y Vim no pudo recuperar). Si Vim genera mensajes de advertencia al recuperar un archivo, lea éstos cuidadosamente. Aún así, es poco habitual.

source: This usually happens if you already recovered your changes, or you wrote the file after making changes. It is safe to delete the swap file now.
es_es: Habitualmente, esto ocurre si ya ha recuperado los cambios, o si editó el archivo después de realizar cambios. En este momento ya puede eliminar el archivo de intercambio.

source: It is normal that the last few changes can not be recovered. Vim flushes the changes to disk when you don't type for about four seconds, or after typing about two hundred characters. This is set with the 'updatetime' and 'updatecount' options. Thus when Vim didn't get a chance to save itself when the system went down, the changes after the last flush will be lost.
es_es: Es normal que los últimos cambios no se puedan recuperar. Vim vuelca los cambios al disco duro cuando no teclea durante cuatro segundos, o tras escribir unos doscientos caracteres. Esto se puede modificar con las opciones 'updatetime' y 'updatecount'. De esta forma, cuando Vim no tiene posibilidad de guardar cuando el sistema cae, tendrá los cambios del último volcado.

source: *11.2* Where is the swap file?
es_es: *11.2* ¿Dónde está el archivo de intercambio?

source: Vim can store the swap file in several places. Normally it is in the same directory as the original file. To find it, change to the directory of the file, and use: >
es_es: Vim puede guardar el archivo de intercambio en distintos lugares. Normalmente se encuentra en el mismo directorio que el archivo original. Para encontrarlo, cambie al directorio del archivo y escriba: >

source: Vim will list the swap files that it can find. It will also look in other directories where the swap file for files in the current directory may be located. It will not find swap files in any other directories though, it doesn't search the directory tree. The output could look like this:
es_es: Vim usará una lista de archivos de intercambio que ha encontrado. También buscará en otros directorios donde los archivos de intercambio para archivos en el actual puedan encontrarse. No buscará archivos de intercambio en otros directorios, ni siquiera en los subdirectorios. La salida se parecerá a esto:

source: If there are several swap files that look like they may be the one you want to use, a list is given of these swap files and you are requested to enter the number of the one you want to use. Carefully look at the dates to decide which one you want to use. In case you don't know which one to use, just try them one by one and check the resulting files if they are what you expected.
es_es: Si hay varios archivos de intercambio que parecen ser el que quiere usar, se mostrará una lista y se requerirá que introduzcas el número del que quiere seleccionar. Observe con cuidado las fechas para decidir cuál quieres usar. En caso de que no sepa cuál seleccionar, pruébelos uno a uno y compruebe que los archivos resultantes son el que deseas.

source: If you know which swap file needs to be used, you can recover by giving the swap file name. Vim will then finds out the name of the original file from the swap file.
es_es: Si sabe qué archivo de intercambio quiere usar, puede realizar la intercambio dando como argumento el nombre de este archivo. Vim encontrará el nombre del archivo original del cuál éste es el archivo de intercambio.

source: Example: > vim -r .help.txt.swo
es_es: Ejemplo: > vim -r .help.txt.swo

source: This is also handy when the swap file is in another directory than expected. Vim recognizes files with the pattern *.s[uvw][a-z] as swap files.
es_es: Esto resulta útil cuando el archivo de intercambio está en otro directorio diferente al esperado. Vim reconoce los archivos con el patrón *.s[uvw][a-z] como archivos de intercambio.

source: If this still does not work, see what file names Vim reports and rename the files accordingly. Check the 'directory' option to see where Vim may have put the swap file.
es_es: Si esto tampoco funciona, compruebe los nombres de archivo que Vim reporta y renombre los archivos acordemente. Compruebe la opción 'directory' para ver dónde ha podido poner Vim el archivo de intercambio.

source: *11.3* Crashed or not? *ATTENTION* *E325*
es_es: *11.3* ¿Se ha colgado o no? *ATTENTION* *E325*

source: Vim tries to protect you from doing stupid things. Suppose you innocently start editing a file, expecting the contents of the file to show up. Instead, Vim produces a very long message:
es_es: Vim intenta protegerle de cometer estupideces. Suponga que inocentemente comienza la edición de un archivo, a la espera de que los contenidos se muestren. En su lugar, Vim produce un mensaje muy largo:

source: E325: ATTENTION ~ Found a swap file by the name ".main.c.swp" ~ owned by: mool dated: Tue May 29 21:09:28 2001 ~ file name: ~mool/vim/vim6/src/main.c ~ modified: no ~ user name: mool host name: masaka.moolenaar.net ~ process ID: 12559 (still running) ~ While opening file "main.c" ~ dated: Tue May 29 19:46:12 2001 ~ ~ (1) Another program may be editing the same file. ~ If this is the case, be careful not to end up with two ~ different instances of the same file when making changes. ~ Quit, or continue with caution. ~ ~ (2) An edit session for this file crashed. ~ If this is the case, use ":recover" or "vim -r main.c" ~ to recover the changes (see ":help recovery"). ~ If you did this already, delete the swap file ".main.c.swp" ~ to avoid this message. ~
es_es: E325: ATENCIÓN ~ Se ha encontrado un archivo de intercambio con el nombre ".main.c.swp" ~ propiedad de: mool de fecha: Tue May 29 21:09:28 2001 ~ nombre del archivo: ~mool/vim/vim6/src/main.c ~ modificado: no ~ nombre del usuario: mool host name: masaka.moolenaar.net ~ ID del proceso: 12559 (aún en ejecución) ~ al abrir el archivo "main.c" ~ de fecha: Tue May 29 19:46:12 2001 ~ ~ (1) Puede que otro programa esté editando el mismo archivo. ~ De ser así, tenga cuidado de no acabar con dos ~ ejemplares diferentes del mismo archivo al hacer cambios. ~ Salga del programa o continúe con precaución. ~ ~ (2) Falló una sesión de edición de este archivo. ~ Si es así, use \":recover\" o \"vim -r main.c" ~ para recuperar los cambios (véa \":help recovery\"). ~ Si Ud. ya ha hecho esto, borre el archivo de intercambio ".main.c.swp" ~ para evitar este mensaje. ~

source: You get this message, because, when starting to edit a file, Vim checks if a swap file already exists for that file. If there is one, there must be something wrong. It may be one of these two situations.
es_es: Ha recibido este mensaje porque cuando comienza a editar un archivo, Vim comprueba que exista un archivo de intercambio para este archivo. Si hay uno, algo debe estar pasando. Puede ocurrir cualquiera de estas situaciones:

source: 1. Another edit session is active on this file. Look in the message for the line with "process ID". It might look like this:
es_es: 1. Hay otra sesión de edición activa en este archivo. Busque en el mensaje la línea con «ID del proceso». Puede parecerse a esto:

source: process ID: 12559 (still running) ~
es_es: process ID: 12559 ((aún en ejecución) ~

source: The text "(still running)" indicates that the process editing this file runs on the same computer. When working on a non-Unix system you will not get this extra hint. When editing a file over a network, you may not see the hint, because the process might be running on another computer. In those two cases you must find out what the situation is yourself. If there is another Vim editing the same file, continuing to edit will result in two versions of the same file. The one that is written last will overwrite the other one, resulting in loss of changes. You better quit this Vim.
es_es: El texto «(still running)» indica que el proceso que edita este archivo está corriendo en el mismo ordenador. Cuando estés bajo un sistema no Unix, no obtendrá esta información extra. Cuando edite un archivo a través de red, seguramente no verá esta información, porque el proceso estará en otro ordenador. Tendrá que averiguarlo por su cuenta. Si hay otro Vim editando el mismo archivo, continuar editándolo conllevará a que tenga dos versiones del mismo archivo. La última que guarde sobreescribirá a la otra, con la consecuente pérdida de los cambios. Mejor salir de este Vim.

source: 2. The swap file might be the result from a previous crash of Vim or the computer. Check the dates mentioned in the message. If the date of the swap file is newer than the file you were editing, and this line appears:
es_es: 2. El archivo de intercambio puede ser el resultado de un cuelgue anterior de Vim o del ordenador. Revise las fechas mencionadas en el mensaje. Si la fecha del archivo de intercambio es más reciente que la del archivo que está editando, y aparece esta línea:

source: modified: YES ~
es_es: modificado: YES ~
